app/controllers/products_controller.rb

  def index
    @products = Product.order(id: :desc)
---
SELECT "products".* FROM "products" ORDER BY "products"."id" DESC

  def product_list
    @first_page = 1
    @record_in_page = 5
    @last_page = (Product.count / @record_in_page).to_i

    sorting_order = params[:order].present? ? params[:order].to_sym : :asc
    @products = Product.order(name: sorting_order).paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "products"
SELECT "products".* FROM "products" ORDER BY "products"."name" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "dsdsd"], ["description", "sdsdsd"], ["created_at", "2024-03-02 15:28:20.040063"], ["updated_at", "2024-03-02 15:28:20.040063"]]

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "New Product22"], ["updated_at", "2024-03-02 15:50:22.872886"], ["id", 41]]

  def destroy
    @product = Product.destroy(params[:id])
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 19]]